app/Controllers/Admin/ExpenseController.php

    public function index()
    {
        $expenses['expence_data'] = $this->expenseModel->orderBy('expense_date', 'DESC')->paginate(2);
---
SELECT *
FROM `expenses`
ORDER BY `expense_date` DESC
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `expenses`

    public function addExpense()
    {
        $rules = [
            'expense_purpose' => 'required|string|max_length[255]',
            'expenser_name'   => 'required|string|max_length[255]',
            'amount'          => 'required|numeric',
            'expense_date'    => 'required|valid_date'
        ];
        if (!$this->validate($rules)) {
            return $this->response
            ->setStatusCode(422)
            ->setJSON([
                'error' => 'Please fill all required fields correctly.',
            ]);
        }
        $data = $this->request->getPost();
        $expenseData = [
            'expencePurpose' => $data['expense_purpose'],
            'expenser_name' => $data['expenser_name'],
            'amount' => $data['amount'],
            'expense_date' => $data['expense_date']
        ];
        $this->expenseModel->insert($expenseData);
---
INSERT INTO `expenses` (`expencePurpose`, `expenser_name`, `amount`, `expense_date`) VALUES ('Nasta Khoroch', 'Tarak', '100', '2025-12-09')