app/Controllers/Admin/ExpenseController.php

    public function searchExpenses()
    {
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        if (!$startDate || !$endDate) {
            return $this->response
                ->setStatusCode(422)
                ->setJSON(['error' => 'Please provide both start and end dates.']);
        }

        $expenses = $this->expenseModel
            ->where('expense_date >=', $startDate)
            ->where('expense_date <=', $endDate)
            ->orderBy('expense_date', 'DESC')
            ->findAll();
---
SELECT *
FROM `expenses`
WHERE `expense_date` >= '2025-11-18'
AND `expense_date` <= '2025-12-18'
ORDER BY `expense_date` DESC