app/Controllers/Admin/SellProduct.php

    public function index()
    {
        // Fetch all products from the database
        $products = $this->productsModel->where('quantity >', 0)->findAll();
---
SELECT *
FROM `products`
WHERE `quantity` > 0

    public function getReportData()
    {
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        // Validate date inputs
        if (empty($startDate) || empty($endDate)) {
            return $this->response->setJSON(['error' => 'Start date and end date are required.']);
        }

        // Fetch sales data within the date range
        $sales = $this->saleModel->where('created_at >=', $startDate)
            ->where('created_at <=', $endDate)
            ->findAll();
---
SELECT *
FROM `sales`
WHERE `created_at` >= '2025-06-06'
AND `created_at` <= '2025-07-06'