app/Controllers/Home.php

SELECT *
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE DATE(created_at) = '2025-07-01'
SELECT *
FROM `sales`
ORDER BY `created_at` DESC
 LIMIT 1
SELECT SUM(product_buying_price) as total_buying, SUM(selling_price) as total_selling
FROM `sales`
WHERE `created_at` >= '2025-06-01'
AND `created_at` <= '2025-06-30'
 LIMIT 1
---
    public function index(): string
    {
        // Fetch all products from the database
        $products = $this->productsModel->findAll();
        $totalProducts = count($products);
        // Fetch all sales from the database
        $today = date('Y-m-d');
        $todaySales = $this->saleModel
            ->where('DATE(created_at)', $today)
            ->countAllResults();
        $lastSold = $this->saleModel->orderBy('created_at', 'DESC')->first();
        $status = 'None';
        if ($lastSold) {
            $quantity = $lastSold['quantity'] ?? 1;
            $quantity = ($quantity > 0) ? $quantity : 1;
            $sellPrice = $lastSold['selling_price'] ?? 0;
            $buyPrice = $lastSold['product_buying_price'] ?? 0;
            $singleSellPrice = $sellPrice / $quantity;
            $profit = $singleSellPrice - $buyPrice;
            if ($profit > 0) {
            $status = 'Profited';
            } elseif ($profit < 0) {
            $status = 'Loss';
            }
        }
        // Calculate last month's total profit
        $firstDayLastMonth = date('Y-m-01', strtotime('first day of last month'));
        $lastDayLastMonth = date('Y-m-t', strtotime('last day of last month'));

        $lastMonthSales = $this->saleModel
            ->select('SUM(product_buying_price) as total_buying, SUM(selling_price) as total_selling')
            ->where('created_at >=', $firstDayLastMonth)
            ->where('created_at <=', $lastDayLastMonth)
            ->first();