app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'rerew'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $this->usersModel->where('username', $username)->first();