app/Controllers/Products.php

    public function index()
    {
        $data['products'] = $this->productsModel->findAll();
---
SELECT *
FROM `products`

    public function getSingleProduct()
    {
        $productId = $this->request->getPost('product_id');
        $product = $this->productsModel->find($productId);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'

    public function addProduct()
    {
        $data = [
            'name' => $this->request->getPost('product_name'),
            'quantity' => $this->request->getPost('product_quantity'),
            'sku' => $this->request->getPost('product_sku'),
            'buying_price' => $this->request->getPost('product_buying_price'),
            'created_at' => date('Y-m-d H:i:s'),
        ];

        if ($this->productsModel->insert($data)) {
---
INSERT INTO `products` (`name`, `quantity`, `sku`, `buying_price`, `created_at`) VALUES ('Bluetooth headphone', '0', 'GTF', '500', '2025-07-01 03:18:29')