app/Controllers/SellProduct.php

    public function index()
    {
        // Fetch all products from the database
        $products = $this->productsModel->findAll();
---
SELECT *
FROM `products`