app/Models/InvestratorModel.php

    public function getInvestmentsWithInvestors($perPage = 10)
    {
        return $this->select([
                    'investrators.id',
                    'investrators.amount',
                    'investrators.invest_date',
                    'investrators.note',
                    'investators_persons.investor_name'
                ])
                ->join(
                    'investators_persons',
                    'investators_persons.id = investrators.investor_id',
                    'left'
                )
                ->orderBy('invest_date', 'DESC')
                ->paginate($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `investrators`
LEFT JOIN `investators_persons` ON `investators_persons`.`id` = `investrators`.`investor_id`
SELECT `investrators`.`id`, `investrators`.`amount`, `investrators`.`invest_date`, `investrators`.`note`, `investators_persons`.`investor_name`
FROM `investrators`
LEFT JOIN `investators_persons` ON `investators_persons`.`id` = `investrators`.`investor_id`
ORDER BY `invest_date` DESC
 LIMIT 10

    public function getInvsNames()
    {
        $builder = $this->db->table('investators_persons');
        $query = $builder->select('id, investor_name')->get();
---
SELECT `id`, `investor_name`
FROM `investators_persons`