app/Libraries/Template.php

    public function admin_panel(string $view, array $data = []): string
    {
        $session = session();
        if ($session->get('logged_in')) {
            $user_id = $session->get('user_id');
            $user = $this->usersModel->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'